robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/app/2FOC.c
volatile int  SKp =  8;
volatile int  SKi =  2;
volatile char SKs = 10;
volatile long SIntLimit = 0;//800L*1024L;

/////////////////////////////////////////

void setMaxCurrent(int max)
{
    gMaxCurrent = max;
    sI2Tlimit = ((long)(gMaxCurrent/100)*(long)(gMaxCurrent/100))*(UDEF_I2T_LIMIT*UDEF_I2T_LIMIT);
    //sI2Tlimit = ((long)(5000/100)*(long)(5000/100))*(UDEF_I2T_LIMIT*UDEF_I2T_LIMIT);
}

void setIPid(int kp, int ki, char shift)
{
    IKp = kp;
    IKi = ki/2;
    IKs = shift;
    IIntLimit = ((long)PWM_MAX)<<shift;
}

void setSPid(int kp, int ki, char shift)
{
    SKp = kp;
    SKi = ki/2;
    SKs = shift;
    SIntLimit = ((long)PWM_MAX)<<shift;
}

void ZeroControlReferences()
{
    CtrlReferences.VqRef = 0;
    CtrlReferences.IqRef = 0;
    CtrlReferences.WRef = 0;

    VdA = 0;
    VqA = 0;
    VqL = 0;
    VqRef = 0;
    IqRef = 0;
    speed_error_old = 0;
    Is = 0;
    iQerror_old = 0;
    iDerror_old = 0;
    limit = 0;
    // TODO: zero position and sensored torque references
}

void RequestControlMode(char cm)
{
    //if (cm == gControlMode) return;

    ZeroControlReferences();

    ++gCtrlModeReqCnt;
    gCtrlModeReq = cm;
}

void ResetSetpointWatchdog()
{
    WriteTimer5(0);
    IFS1bits.T5IF = 0;
}

        ///////////////////////////
        /*
        static int qe_watchdog = 0;
        if (delta)
        {
            QEisOk = 1;
            qe_watchdog = 0;
        }
        else if (!MotorConfig.has_hall)
        {
            if ((I2Tdata.IQMeasured > gMaxCurrent/2) || (I2Tdata.IQMeasured < -gMaxCurrent/2))
            {
                if (++qe_watchdog > 10000)
                {
                    // QE is broken
                    qe_watchdog = 0;
                    gEncoderError.stuck = TRUE;
                    SysError.EncoderFault = TRUE;
                    FaultConditionsHandler();
                }
            }
        }
        */
        ///////////////////////////

BOOL updateOdometry()
{
    if (MotorConfig.has_qe)
    {
        static const int UNDERSAMPLING = PWMFREQUENCY / 1000;
        static int speed_undersampler = 0;

        //static long position_old = 0;
        //long position = QEgetPos();
        //long delta = (long)position - (long)position_old;

        static unsigned int position_old = 0;
        unsigned int position = QEgetPos();
        int delta = position - position_old;

        position_old = position;

        if (sAlignInProgress)
        {
            gQEPosition = 0;
            gQEVelocity = 0;
            return FALSE;
        }

        //if (delta < -32767) delta += 65536L; else if (delta > 32767) delta -= 65536L;

        gQEPosition += delta;

        if (++speed_undersampler == UNDERSAMPLING) // we obtain ticks per ms
        {
            speed_undersampler = 0;

            static long QEPosition_old = 0;

            gQEVelocity = (1 + gQEVelocity + gQEPosition - QEPosition_old) / 2;

            QEPosition_old = gQEPosition;

            return TRUE;
        }

        return FALSE;
    }
    else // no QE
    {
        gQEPosition = DHESPosition();
        gQEVelocity = DHESVelocity();

        return FALSE;
    }
}

int alignRotor(volatile int* IqRef)
{
    if (MotorConfig.has_hall) return 0;

    static int enc_fake = 0;
    static int IqRef_fake = 0;

    if (QEready())
    {
        sAlignInProgress = -1;
    }

    if (sAlignInProgress == -1)
    {
        if (IqRef_fake > 0) --IqRef_fake; else { sAlignInProgress = 0; QEcountErrorClear(); }
    }
    else if (sAlignInProgress == 1)
    {
        if (IqRef_fake < 2000) ++IqRef_fake; else sAlignInProgress = 2;
    }
    else if (sAlignInProgress == 2)
    {
        if (enc_fake < 10*QE_ELETTR_DEG_PER_REV()) ++enc_fake; else sAlignInProgress = 3;
    }
    if (sAlignInProgress == 3)
    {
        if (enc_fake > -10*QE_ELETTR_DEG_PER_REV())
        {
            --enc_fake;
        }
        else
        {
            // Index is broken
            *IqRef = 0;
            IqRef_fake = 0;
            QE_RISE_ERROR(index_broken);
        }
    }

    *IqRef = IqRef_fake;

    int enc_ret = enc_fake/10;

    while (enc_ret < 0) enc_ret+=360;

    return enc_ret;
}

// DMA0 IRQ Service Routine used for FOC loop

//volatile int gulp_sector;
//volatile int gulp_delta;

void __attribute__((__interrupt__, no_auto_psv)) _DMA0Interrupt(void)
{
    int Vq = 0;

    static const int cos_table[] = {32767,32763,32748,32723,32688,32643,32588,32523,32449,32364,32270,32165,32051,31928,31794,31651,31498,31336,31164,30982,30791,30591,30381,30163,29935,29697,29451,29196,28932,28659,28377};
    static const int sin_table[] = {    0,  330,  660,  990, 1319, 1648, 1977, 2305, 2632, 2959, 3285, 3609, 3933, 4255, 4576, 4896, 5214, 5531, 5846, 6159, 6470, 6779, 7087, 7392, 7694, 7995, 8293, 8588, 8881, 9171, 9459};

    static int *ppwmH = NULL, *ppwmL = NULL, *ppwm0 = NULL;
    static int Va = 0, Vb = 0, Vc = 0;
    
    static short *iH,*iL,*i0;

    static BOOL starting = TRUE;

    // setting CORCON in this way rather than using CORCONbits is
    // slightly more efficient (because CORCONbits is volatile and
    // optimizer cannot collapse multiple bit operations)
    CORCON = 0b11110100;

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
    // scale currents by MeasCurrParm.qKa, qKb, qKc
    // Calculate ParkParm.qIa, qIb, qIc
    MeasAndCompIaIcCalculateIb();

    ParkParm.qIb = -ParkParm.qIa-ParkParm.qIc;

    ParkParm.qIa /= 3;
    ParkParm.qIb /= 3;
    ParkParm.qIc /= 3;

    int enc = 0;
    static int enc_start_sec = 0;
    BOOL has_speed_sample = FALSE;

    if (MotorConfig.has_qe)
    {
        // overwrite encoders during alignment
        if (sAlignInProgress)
        {
            enc = alignRotor(&IqRef);
        }
        else
        {
            enc = QEgetElettrDeg();
        }
    }

    has_speed_sample = updateOdometry();

    // enc is in [0 - 360) range here

    char sector = 0;

    if (MotorConfig.has_hall)
    {
      //static const char dhes2sector[] = {0,1,3,2,5,6,4};
        static const char dhes2sector[] = {0,4,6,5,2,3,1};
        sector = dhes2sector[DHESRead()];

      //static const int dhes2angle[] = {0,0,120,60,240,300,180};
      //enc = dhes2angle[DHESRead()];
    }
    else
    {
        sector = 1 + enc/60;
    }

    //gulp_sector = sector;

    static char sector_stored = 0;
    static char sector_stored_old = 0;

    if (sector_stored != sector)
    {
        if (MotorConfig.has_qe)
        {
            if (MotorConfig.has_hall)
            {
                unsigned int poscnt = QEgetRaw();
                static unsigned int poscnt_old = 0xFFFF;
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                        SysError.EncoderFault = TRUE;
                        FaultConditionsHandler();
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }

                if (sector==1 && sector_stored==6) // positive
                {
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else if (sector==6 && sector_stored==1) // negative
                {
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
                else if (sector>sector_stored)
                { // positive rotation
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else
                { // negative rotation
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
            }
        }

