robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/app/2FOC.c
        sector_stored_old = sector_stored;
        sector_stored = sector;

        switch (sector)
        {
            case 1: // Sector 1: (0,0,1)   60-120 degrees
                iH = &(ParkParm.qIa); iL = &(ParkParm.qIb); i0 = &(ParkParm.qIc);
                ppwmH = &Va; ppwmL = &Vb; ppwm0 = &Vc;
                break;

            case 2: // Sector 2: (0,1,1)  120-180 degrees
                iH = &(ParkParm.qIa); iL = &(ParkParm.qIc); i0 = &(ParkParm.qIb);
                ppwmH = &Va; ppwm0 = &Vb; ppwmL = &Vc;
                break;

            case 3: // Sector 3: (0,1,0)  180-240 degrees
                iH = &(ParkParm.qIb); iL = &(ParkParm.qIc); i0 = &(ParkParm.qIa);
                ppwm0 = &Va; ppwmH = &Vb; ppwmL = &Vc;
                break;

            case 4: // Sector 4: (1,1,0)  240-300 degrees
                iH = &(ParkParm.qIb); iL = &(ParkParm.qIa); i0 = &(ParkParm.qIc);
                ppwmL = &Va; ppwmH = &Vb; ppwm0 = &Vc;
                break;

            case 5: // Sector 5: (1,0,0)  300-360 degrees
                iH = &(ParkParm.qIc); iL = &(ParkParm.qIa); i0 = &(ParkParm.qIb);
                ppwmL = &Va; ppwm0 = &Vb; ppwmH = &Vc;
                break;

            case 6: // Sector 6: (1,0,1)    0- 60 degrees
                iH = &(ParkParm.qIc); iL = &(ParkParm.qIb); i0 = &(ParkParm.qIa);
                ppwm0 = &Va; ppwmL = &Vb; ppwmH = &Vc;
                break;
        }
    }

    BOOL negative_sec = sector%2;

    int delta = 0;

    if (MotorConfig.has_hall)
    {
        if (MotorConfig.has_qe)
        {
            delta = enc - enc_start_sec;

            //gulp_delta = delta;

            if (delta >= 180) delta -= 360; else if (delta < -180) delta += 360;

            if (delta>30) delta=30; else if (delta<-30) delta=-30;
        }
    }
    else
    {
        delta = (enc%60)-30;
    }

    // back compatibility
    //delta = 0;

    int sinT,cosT;

    if (delta<0)
    {
        cosT =  cos_table[-delta];
        sinT = -sin_table[-delta];
    }
    else
    {
        cosT =  cos_table[ delta];
        sinT =  sin_table[ delta];
    }

    if (negative_sec)
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)-3*(int)(__builtin_mulss(   *i0   ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */     -(int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }
    else
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)+3*(int)(__builtin_mulss(  *i0    ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */      (int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }

    if (!sAlignInProgress)
    {
        if (gControlMode == icubCanProto_controlmode_speed_current
         || gControlMode == icubCanProto_controlmode_speed_voltage)
        {
            if (has_speed_sample)
            {
                int speed_error = CtrlReferences.WRef - gQEVelocity;

                if (gControlMode == icubCanProto_controlmode_speed_current)
                {
                    Is += (((long) (speed_error - speed_error_old)) << 4) + (long) (speed_error + speed_error_old);

                    if (Is > gMaxCurrent) Is = gMaxCurrent; else if (Is < -gMaxCurrent) Is = -gMaxCurrent;

                    if (starting)
                    {
                        if (Is > 0)
                        {
                            if (Is > IqRef) ++IqRef; else { IqRef = (int)Is; starting = FALSE; }
                        }
                        else
                        {
                            if (Is < IqRef) --IqRef; else { IqRef = (int)Is; starting = FALSE; }
                        }
                    }
                    else
                    {
                        IqRef = (int)Is;
                    }
                }
                else
                {
                  //VqRef += (((long) (speed_error - speed_error_old)) << 8) + ((long) (speed_error + speed_error_old)<<2);
                    VqRef += __builtin_mulss(speed_error-speed_error_old,SKp) + __builtin_mulss(speed_error + speed_error_old,SKi);

                    if (VqRef > SIntLimit) VqRef = SIntLimit; else if (VqRef < -SIntLimit) VqRef = -SIntLimit;

                    IqRef = 0;
                }

                speed_error_old = speed_error;
            } // has_speed_sample
        }
        else if (gControlMode == icubCanProto_controlmode_current)
        {
            VqRef = 0;
            IqRef = CtrlReferences.IqRef;

            if (IqRef>gMaxCurrent) IqRef = gMaxCurrent; else if (IqRef<-gMaxCurrent) IqRef = -gMaxCurrent;
        }
        else if (gControlMode == icubCanProto_controlmode_openloop)
        {
            VqRef = ((long)CtrlReferences.VqRef)<<(IKs-VOLT_REF_SHIFT);
            IqRef = 0;
        }
        else
        {
            VqRef = 0;
            IqRef = 0;
        }
    }
    ////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Iq control loop

    Vq = 0;

    // current closed loop
    if (gControlMode == icubCanProto_controlmode_speed_current 
     || gControlMode == icubCanProto_controlmode_current
     || sAlignInProgress)
    {
        int iQerror = IqRef-I2Tdata.IQMeasured;

        //VqA += /*(((long)(iQerror-iQerror_old))<<3) +*/ (long)(iQerror+iQerror_old);
        //VqA += (((long)(iQerror-iQerror_old))<<3) + (long)(iQerror+iQerror_old);
        VqA += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);

        iQerror_old = iQerror;

        if (VqA > IIntLimit) VqA = IIntLimit; else if (VqA < -IIntLimit) VqA = -IIntLimit;

        Vq = (int)(VqA>>IKs);

        // alternative formulation with ff term
        //VqA += __builtin_mulss(iQerror+iQerror_old,Ki);
        //if (VqA > V_INT_LIMIT) VqA = V_INT_LIMIT; else if (VqA < -V_INT_LIMIT) VqA = -V_INT_LIMIT;
        //long VqF = VqA + __builtin_mulss(43,IqRef) + __builtin_mulss(93,gQEVelocity);
        //if (VqF > V_INT_LIMIT) VqF = V_INT_LIMIT; else if (VqF < -V_INT_LIMIT) VqF = -V_INT_LIMIT;
        //Vq = (int)(VqF>>Kshift);
    }
    else // current open loop
    {
        if (I2Tdata.IQMeasured > gMaxCurrent)
        {
            limit =  1;
        }
        else if (I2Tdata.IQMeasured < -gMaxCurrent)
        {
            limit = -1;
        }

        if (limit)
        {
            if (limit == 1)
            {
                int iQerror =  gMaxCurrent-I2Tdata.IQMeasured;
                //VqL += (((long)(iQerror-iQerror_old))<<3) + (long)(iQerror+iQerror_old);
                VqL += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);
                iQerror_old = iQerror;

